from ultralytics import YOLO


# =========================================================
# 1. 기본 YOLO 모델 로드
# =========================================================

model = YOLO("yolov8n.pt")


# =========================================================
# 2. YOLO 학습
# =========================================================

results = model.train(

    # 데이터 설정 파일
    data="data.yaml",

    # 학습 횟수
    epochs=50,

    # 이미지 크기
    imgsz=640,

    # 한 번에 학습할 이미지 수
    batch=8,

    # 학습 결과 폴더
    project="runs/detect",

    # 학습 이름
    name="recycle_yolo",

    # 기존 결과 덮어쓰기 허용
    exist_ok=True,

    # GPU가 있으면 자동 사용
    device=0
)